"Aw crap" = "Ma sranje";
"Back" = "Natrag";
"Half full" = "Polupuna";
"How ya feeling today?" = "Kako ya osjećaš danas?";
"Live half full." = "Uživo napola puna.";
"Loading..." = "Loading ...";
"Next" = "Sljedeći";
"No internet connection" = "Nema priključak za internet";
"OK" = "OK";
"Patience is a virtue." = "Strpljenje je vrlina.";
"Share to Facebook" = "Podijeli na Facebook";
"Share to Twitter" = "Podijeli na Twitteru";
"Sorry, this quote is too long to post to Twitter." = "Žao nam je, ovaj citat je predugo na post na Twitter.";
"The app that turns your frown upside down with a dose of inspiration to kick any bad mood in the butt!" = "App koji pretvara vaše mrštenje naopako uz dozu inspiracije udariti bilo loše raspoloženje u stražnjicu!";
"The glass is always" = "Staklo je uvijek";
"The quote hasn't loaded yet." = "Citat nije umetnut još.";
"Try Again" = "Try Again";
"Whoops" = "Joj";
"don't be angry." = "ljut";
"don't be impatient." = "nestrpljiv";
"don't be tired." = "umoran";
"don't be lonely." = "usamljen";
"don't be depressed." = "potišten";
"don't be guilty." = "kriv";
"don't be sad." = "tužan";
"don't be nostalgic." = "nostalgičan";
"don't be jealous." = "ljubomoran";
"don't be dull." = "glup";
"don't be scared." = "prestrašen";
"don't be anxious." = "tjeskoban";
"angry" = "ljut";
"impatient" = "nestrpljiv";
"tired" = "umoran";
"lonely" = "usamljen";
"depressed" = "potišten";
"guilty" = "kriv";
"sad" = "tužan";
"nostalgic" = "nostalgičan";
"jealous" = "ljubomoran";
"dull" = "glup";
"scared" = "prestrašen";
"anxious" = "tjeskoban";
